import streamlit as st

container = st.container(border=True)

st.markdown("<h1 style='text-align: right; '>وش السيارة الي أشتريها؟🚗</h1><br>", unsafe_allow_html=True)

st.markdown("<p style='text-align: right; '>باتمان: سوبرمان .. من طول الغيبات جاب الغنايم .. اسمع اليوم وأنا راجع من نداء الواجب ارتفعت درجة حرارة السيارة وصار لي عطل بالسيارة وما قدرت أروح أنقذ ناس كانوا بورطة, وأزيدك من الشعر بيت كان الوقت الظهر في وسط حر صيف الرياض القاتل</p><br>", unsafe_allow_html=True)

st.markdown("<p style='text-align: right; '>(باتمان يصيح)</p>", unsafe_allow_html=True)
st.image("bat2.jpg")

st.markdown("<p style='text-align: right; '>سوبرمان:  لحمد لله إني أطير مو مثلك متوهق بالسيارات بس اسمع غير سيارتك لأنه مهم تكون سيارتك كويسة وأنت تقاتل</p><br>", unsafe_allow_html=True)
st.markdown("<p style='text-align: right; '>(سوبرمان وهو يطير ويضحك)</p>", unsafe_allow_html=True)
st.image("super1.jpg")

st.markdown("<p style='text-align: right; '>باتمان: اي والله محتاج أغير السيارة واشتري سيارتين بعد بس إني متوهق إيش السيارة اللي أشتريها</p><br>", unsafe_allow_html=True)

st.markdown("<p style='text-align: right; '>(باتمان يفكر اممممممم)</p>", unsafe_allow_html=True)
st.image("bat1.jpg")

st.markdown("<p style='text-align: right; '>سوبرمان:  رأيي تاخذ سيارتين سيارة حق المطامر تركب الرصيف وتلاحق الأشرار فيها وتكون كبيرة وتتحمل والثانية تتخفى فيها يعني تكون سيارة شعبية تشبه سيارات الناس الطبيعيين اللي مو زينا</p><br>(سوبرمان يتكلم بحماس)<br>", unsafe_allow_html=True)

st.markdown("<p style='text-align: right; '></p>باتمان: يا سلام عليك والله أنك خوي أجودي, طيب اسمع عطني اقتراحاتك للسيارتين لأني الصدق متوهق ومحتاج سيارة الحين <br>(باتمان مستعجل)<br> ", unsafe_allow_html=True)
st.image("bat3.jpg")

st.markdown("<p style='text-align: right; '>سوبرمان: أبشر طال عمرك, عندك تويوتا تعتبر أكثر سيارة تباع بالسعودية حسب موقع سيارة, جودتها ممتازة وتتحمل الاستخدام اليومي وحرارة الجو واذا شافوك فيها يعتبرونك شخص طبيعي مثل أي أحد ما يشكون فيك </p><br>", unsafe_allow_html=True)
st.image("chart1.jpg")

st.markdown("<p style='text-align: right; '>سوبرمان: أكيد تويوتا مشهورة بكل النوعين ولا تشيل هم هنا عندك أكثر أنواع سيارات تويوتا لكل القيرين .. ويمديك بالقير الاوتوماتيك تستخدم اليدوي</p><br>", unsafe_allow_html=True)
st.image("chart2.jpg")

st.markdown("<p style='text-align: right; '>باتمان: طيب خلني أكمل بحث بشوف وش أكثر سيارة في تويوتا تنباع؟</p><br>", unsafe_allow_html=True)

st.markdown("<p style='text-align: right; '>سوبرمان: لاندكروزر يسمونها مفخرة الارض وتعتبر خيار موفق في الشراء بشكل ما تتوقعه</p><br>", unsafe_allow_html=True)
st.image("land.jpg")

st.image("chart3.jpg")
st.markdown("<p style='text-align: right; '>باتمان: يا سلام خلاص أنا شكلي بعتمدها للطلعات الطبيعية حق الزيارة والأهل, طيب المشكلة بالسيارة الثانية أحتاج وحدة تتحمل مقاتلة المهابيل وقوية تطير فيني بالشارع </p><br>", unsafe_allow_html=True)

st.markdown("<p style='text-align: right; '>سوبرمان: طيب فيه سيارة رهيبة وكنها مصنوعة لك سعة محركها عالية 8 وفوق عشان لو تحب تعدلها أو تصفحها, اسمها سوبربان 8 شنابر لقيتها بالسيارات المعروضة</p><br>", unsafe_allow_html=True)
st.image("suburban.jpg")
st.image("subchart.png")
st.image("chart4.jpg")

st.markdown("<p style='text-align: right; '>باتمان: ياخي أنت صدق فنان يا ليتني أطير زيك </p><br>(باتمان يتمنى يطير)<br>", unsafe_allow_html=True)

st.markdown("<p style='text-align: right; '>سوبرمان: يا شيخ ترا بالسيارات هذي تنقذ فيها ملايين الناس وأحمد ربك عندك مكيف </p><br>(سوبرمان يتمنى عنده مكيف)<br>", unsafe_allow_html=True)

st.markdown("<p style='text-align: right; '>باتمان: يعطيك العافية يا سوبرمان، ما قصرت كالعادة في إنقاذ العالم! جاهز نروح نطبق العدالة؟</p><br>", unsafe_allow_html=True)

st.markdown("<p style='text-align: right; '>سوبرمان: يا رجل، الحر ذابحني! إلا لو كانت بسيارتك سوبربان، وقتها بكون جاهز على طول! 😄</p><br>(باتمان وسوبرمان يضحكون)<br>", unsafe_allow_html=True)



